{
  "app-title": "ポートフォリオ",
  "loading": "読み込み中...",
  "greetings": "こんにちは。",
  "name": "山部滉稀",
  "name-end": "です。",
  "sub-heading": "ようこそ、私のホームページへ！ ",
  "more-info": "",
  "resume-btn": "resume",
  "about-heading": "私について",
  "about-text-top": "こんにちは。7年の経験を持つウェブ開発者の＊山部 滉稀＊です。WordPress、ShopifyなどのプラットフォームでCMSウェブサイトを作成することからキャリアをスタートしました。その後、フロントエンドウェブ開発、モバイルアプリ開発、AI駆動型チャットボットウェブサイトなど、スキルセットを拡大してきました。様々な業界のクライアントと協業し、スキルを磨いてきました。CMSウェブサイトの構築やカスタマイズ、カスタムソリューションへの移行、フロントエンドまたはモバイルアプリ開発のサポートなど、何でもお気軽にご相談ください。一緒にデジタルプレゼンスの向上を目指しましょう！",
  "about-text-bottom": "",
  "technology-heading": "テクノロジー",
  "projects-heading": "プロジェクト",
  "featured-tag": "",
  "projects": [
    {
      "id": 1,
      "description": "DMM Loungeは、専門家やインフルエンサーが率いる限定コミュニティとユーザーをつなぐプレミアムオンラインサロンプラットフォームです。私は、メンバーシップダッシュボード、コンテンツ検索フロー、クリエイターツールなど、主要なユーザーインターフェースの設計と開発を担当しました。このプラットフォームは数百のアクティブなサロンをサポートし、デバイスを問わずシームレスな体験を提供しています。"
    },
    {
      "id": 2,
      "description": "VIPCode–Games.comは、カジュアルゲームやマルチプレイヤーのブラウザベースゲームを幅広く提供するオンラインゲームプラットフォームです。私はサイトのフロントエンドインターフェースを構築し、ユーザー認証（ゲストログインとソーシャルログイン）を実装し、デイリー報酬、リーダーボード、リアルタイムマルチプレイヤーサポートなどの機能を統合しました。このサイトは完全にレスポンシブで、デスクトップとモバイルデバイスの両方に最適化されています。"
    },
    {
      "id": 3,
      "description": "私は、レスポンシブなフロントエンド インターフェースの構築、安全なユーザー認証 (ソーシャル サインインやゲスト アクセスを含む) の統合、リアルタイム更新、ユーザー ダッシュボード、リーダーボード システムなどのインタラクティブ機能の実装を担当しました。"
    },
    {
      "id": 4,
      "description": "ドライバーとライダーのためのコミュニティ主導の安全対策を支援するために開発したマイクロサイトです。シンプルでミニマルなデザイン、モバイルファーストのレスポンシブ性、そして共感とロードレイジゼロのメッセージを広めるためのキャンペーンに特化したコンテンツを特徴としています。"
    },
    {
      "id": 5,
      "description": "新生された英語版サイトは、モダンなウェブ技術（レスポンシブデザイン、CSSアニメーション、React/WebGLなど）と、美しいタイポグラフィ（EB Garamond）を活用し、視覚的・操作性に優れたサイト構成です。また、Figmaでのデザイン設計やGSAP / Framerでのアニメーション制御、Webflow等を使った高度なCMS構築により、伝統的な内容をモダンなUXとして提供しています。Awwwardsにもノミネートされた、デザイン・技術両面でハイレベルなサイトです 。"
    },
    {
      "id": 6,
      "description": "実用的なチュートリアル・学習ログの発信に注力しており、「最新トピックス」コーナーでは画像付きで学びの内容を分かりやすく紹介しています。フリーランス向けノウハウとして、制作したWebサイトやデザイン、開発環境セットアップなど、実践的な記事が多数掲載されています。"
    },
    {
      "id": 7,
      "description": "データ分析グループでは DIKW ピラミッドに則ったデータ整備と機械学習モデルの開発・運用（MLOps）を実践。決済ソリューション開発では英語環境下でも高いUX設計、多様な支払い方式を統合。また、UI/UXデザインやサービス全体を通したブランディング力も備えており、技術とユーザー体験の両面で高度に整った組織と言えます。"
    },
    {
      "id": 8,
      "description": "マルチフレームワーク対応::React, Vue, HTML/CSS など複数のフロント技術に対応し、プロジェクト構成に柔軟に適応します , デザイン→コードの自動化::Figma等で作成したデザインをクリック操作でReact/Vue/HTMLのコードに変換。レスポンシブ対応やスタイル設定も自動化されています , AIコードパーソナライズ::GenAIにより、「arrow関数を使う」「コメントを追加する」などの指定が可能。コードを開発チームのコーディングルールに近づけられます 。"
    },
    {
      "id": 9,
      "description": "1.HTML / CSS / Sass：BEMやFLOCSSといった設計思想を用いたセマンティックかつ保守性の高いスタイル設計 2.JavaScript（ピュアJS、jQuery非依存）：ライブラリ依存を避けた記述,Frameworks / SSG：Next.js（静的サイト生成)3.アニメーション・インタラクティブ処理：Three.js（3Dオブジェクト),GSAP（アニメーション全般),AOS、Lenis.jsなど ﹣滑らかなスクロールなど "
    },
    {
      "id": 10,
      "description": "RunwayMLは、以下のAI技術と機能を提供しています：Gen-4：テキストや画像から高品質な映像を生成する先進的なAIモデル。Act-One：映像と音声の入力から表現力豊かなアニメーションを生成するツール。Frames：映像のフレーム補間やスタイル転送などの機能を提供。API / SDK：PythonやNode.js向けのSDKを通じて、開発者が独自のアプリケーションにAI機能を組み込むことができます。"
    },
     {
      "id": 11,
      "description": "Zaikoは、「クリエイターがファンと直接つながる」ことを目的とした日本発のデジタルイベントプラットフォームです。主な特徴は以下のとおりです：/電子チケット販売＆ライブストリーミング　大小問わずオンライン／オフラインイベントに対応し、ライブ配信や事前収録ビデオ、予約・抽選など多様なチケッティング機能を提供/デジタルコンテンツ販売「STICKITS」や「Digitama（デジタル魂）」と呼ばれるNFTを販売し、デジタルグッズの収益化を実現..."
    },
    {
      "id": 12,
      "description": "こちらのページは、“PoC に対応しているシステム開発会社9選【2025年最新版】”と題された、日本国内の中小〜中堅企業が提供するPoC（Proof of Concept）支援サービスの紹介記事です。"
    },
    {
      "id": 13,
      "description": "「Brave Frontier Heroes」は、ドット絵スタイルのNFTバトルRPGで、ブロックチェーン技術を活用してゲーム内アイテムやキャラクターの所有権をNFTとして提供しています。日本発の中小規模のブロックチェーンゲームで、ユーザーが戦略的なバトルを楽しみつつ、NFTによる資産管理が可能なゲームプラットフォームです。ゲーム内資産はブロックチェーン上で管理されるため、ユーザー間の安全な取引や所有権の明確化が実現されています。"
    }
  ],
  "show-more-btn": "",
  "show-less-btn": "",
  "learn-more": "more info",
  "navigation": [
    {
      "menuTitle": "家",
      "href": "/#home"
    },
    {
      "menuTitle": "私について",
      "href": "/#about"
    },
    {
      "menuTitle": "テクノロジー",
      "href": "/#technology"
    },
    {
      "menuTitle": "プロジェクト",
      "href": "/#projects"
    }
  ]
 
}
